; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-34-32)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 room26 room27 room28 room29 room30 room31 room32 room33 room34 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 - object)
(:init
(at-robby robot1 room34)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room28)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room1)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room9)
(at ball2 room12)
(at ball3 room20)
(at ball4 room1)
(at ball5 room2)
(at ball6 room6)
(at ball7 room5)
(at ball8 room1)
(at ball9 room7)
(at ball10 room18)
(at ball11 room1)
(at ball12 room14)
(at ball13 room9)
(at ball14 room25)
(at ball15 room4)
(at ball16 room8)
(at ball17 room12)
(at ball18 room23)
(at ball19 room23)
(at ball20 room13)
(at ball21 room17)
(at ball22 room23)
(at ball23 room25)
(at ball24 room23)
(at ball25 room9)
(at ball26 room25)
(at ball27 room25)
(at ball28 room11)
(at ball29 room25)
(at ball30 room19)
(at ball31 room11)
(at ball32 room34)
)
(:goal
(and
(at ball1 room31)
(at ball2 room31)
(at ball3 room34)
(at ball4 room32)
(at ball5 room3)
(at ball6 room4)
(at ball7 room33)
(at ball8 room9)
(at ball9 room22)
(at ball10 room33)
(at ball11 room23)
(at ball12 room30)
(at ball13 room24)
(at ball14 room26)
(at ball15 room3)
(at ball16 room2)
(at ball17 room15)
(at ball18 room26)
(at ball19 room14)
(at ball20 room31)
(at ball21 room14)
(at ball22 room4)
(at ball23 room19)
(at ball24 room23)
(at ball25 room29)
(at ball26 room10)
(at ball27 room33)
(at ball28 room19)
(at ball29 room29)
(at ball30 room10)
(at ball31 room18)
(at ball32 room25)
)
)
)

; plan
1. (pick robot3 ball8 room1 lgripper3)
   deleted: (at ball8 room1) (free robot3 lgripper3)
   added: (carry robot3 ball8 lgripper3)
   goals met: 1 of 32
2. (pick robot3 ball4 room1 rgripper3)
   deleted: (at ball4 room1) (free robot3 rgripper3)
   added: (carry robot3 ball4 rgripper3)
   goals met: 1 of 32
3. (pick robot1 ball32 room34 lgripper1)
   deleted: (at ball32 room34) (free robot1 lgripper1)
   added: (carry robot1 ball32 lgripper1)
   goals met: 1 of 32
4. (move robot2 room28 room9)
   deleted: (at-robby robot2 room28)
   added: (at-robby robot2 room9)
   goals met: 1 of 32
5. (move robot3 room1 room9)
   deleted: (at-robby robot3 room1)
   added: (at-robby robot3 room9)
   goals met: 1 of 32
6. (move robot1 room34 room7)
   deleted: (at-robby robot1 room34)
   added: (at-robby robot1 room7)
   goals met: 1 of 32
7. (pick robot2 ball25 room9 lgripper2)
   deleted: (at ball25 room9) (free robot2 lgripper2)
   added: (carry robot2 ball25 lgripper2)
   goals met: 1 of 32
8. (pick robot2 ball13 room9 rgripper2)
   deleted: (at ball13 room9) (free robot2 rgripper2)
   added: (carry robot2 ball13 rgripper2)
   goals met: 1 of 32
9. (drop robot3 ball8 room9 lgripper3)
   deleted: (carry robot3 ball8 lgripper3)
   added: (at ball8 room9) (free robot3 lgripper3)
   goals met: 2 of 32
10. (pick robot1 ball9 room7 rgripper1)
   deleted: (at ball9 room7) (free robot1 rgripper1)
   added: (carry robot1 ball9 rgripper1)
   goals met: 2 of 32
11. (move robot2 room9 room29)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room29)
   goals met: 2 of 32
12. (move robot3 room9 room32)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room32)
   goals met: 2 of 32
13. (move robot1 room7 room25)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room25)
   goals met: 2 of 32
14. (drop robot2 ball25 room29 lgripper2)
   deleted: (carry robot2 ball25 lgripper2)
   added: (at ball25 room29) (free robot2 lgripper2)
   goals met: 3 of 32
15. (drop robot3 ball4 room32 rgripper3)
   deleted: (carry robot3 ball4 rgripper3)
   added: (at ball4 room32) (free robot3 rgripper3)
   goals met: 4 of 32
16. (drop robot1 ball32 room25 lgripper1)
   deleted: (carry robot1 ball32 lgripper1)
   added: (at ball32 room25) (free robot1 lgripper1)
   goals met: 5 of 32
17. (move robot2 room29 room9)
   deleted: (at-robby robot2 room29)
   added: (at-robby robot2 room9)
   goals met: 5 of 32
18. (move robot1 room25 room22)
   deleted: (at-robby robot1 room25)
   added: (at-robby robot1 room22)
   goals met: 5 of 32
19. (move robot3 room32 room20)
   deleted: (at-robby robot3 room32)
   added: (at-robby robot3 room20)
   goals met: 5 of 32
20. (pick robot2 ball1 room9 lgripper2)
   deleted: (at ball1 room9) (free robot2 lgripper2)
   added: (carry robot2 ball1 lgripper2)
   goals met: 5 of 32
21. (drop robot1 ball9 room22 rgripper1)
   deleted: (carry robot1 ball9 rgripper1)
   added: (at ball9 room22) (free robot1 rgripper1)
   goals met: 6 of 32
22. (pick robot3 ball3 room20 lgripper3)
   deleted: (at ball3 room20) (free robot3 lgripper3)
   added: (carry robot3 ball3 lgripper3)
   goals met: 6 of 32
23. (move robot2 room9 room31)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room31)
   goals met: 6 of 32
24. (move robot3 room20 room34)
   deleted: (at-robby robot3 room20)
   added: (at-robby robot3 room34)
   goals met: 6 of 32
25. (move robot1 room22 room8)
   deleted: (at-robby robot1 room22)
   added: (at-robby robot1 room8)
   goals met: 6 of 32
26. (drop robot2 ball1 room31 lgripper2)
   deleted: (carry robot2 ball1 lgripper2)
   added: (at ball1 room31) (free robot2 lgripper2)
   goals met: 7 of 32
27. (drop robot3 ball3 room34 lgripper3)
   deleted: (carry robot3 ball3 lgripper3)
   added: (at ball3 room34) (free robot3 lgripper3)
   goals met: 8 of 32
28. (pick robot1 ball16 room8 lgripper1)
   deleted: (at ball16 room8) (free robot1 lgripper1)
   added: (carry robot1 ball16 lgripper1)
   goals met: 8 of 32
29. (move robot2 room31 room24)
   deleted: (at-robby robot2 room31)
   added: (at-robby robot2 room24)
   goals met: 8 of 32
30. (move robot1 room8 room2)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room2)
   goals met: 8 of 32
31. (drop robot2 ball13 room24 rgripper2)
   deleted: (carry robot2 ball13 rgripper2)
   added: (at ball13 room24) (free robot2 rgripper2)
   goals met: 9 of 32
32. (move robot3 room34 room6)
   deleted: (at-robby robot3 room34)
   added: (at-robby robot3 room6)
   goals met: 9 of 32
33. (drop robot1 ball16 room2 lgripper1)
   deleted: (carry robot1 ball16 lgripper1)
   added: (at ball16 room2) (free robot1 lgripper1)
   goals met: 10 of 32
34. (move robot2 room24 room5)
   deleted: (at-robby robot2 room24)
   added: (at-robby robot2 room5)
   goals met: 10 of 32
35. (pick robot1 ball5 room2 rgripper1)
   deleted: (at ball5 room2) (free robot1 rgripper1)
   added: (carry robot1 ball5 rgripper1)
   goals met: 10 of 32
36. (pick robot3 ball6 room6 lgripper3)
   deleted: (at ball6 room6) (free robot3 lgripper3)
   added: (carry robot3 ball6 lgripper3)
   goals met: 10 of 32
37. (move robot3 room6 room4)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room4)
   goals met: 10 of 32
38. (move robot1 room2 room4)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room4)
   goals met: 10 of 32
39. (pick robot2 ball7 room5 lgripper2)
   deleted: (at ball7 room5) (free robot2 lgripper2)
   added: (carry robot2 ball7 lgripper2)
   goals met: 10 of 32
40. (move robot2 room5 room33)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room33)
   goals met: 10 of 32
41. (drop robot3 ball6 room4 lgripper3)
   deleted: (carry robot3 ball6 lgripper3)
   added: (at ball6 room4) (free robot3 lgripper3)
   goals met: 11 of 32
42. (pick robot1 ball15 room4 lgripper1)
   deleted: (at ball15 room4) (free robot1 lgripper1)
   added: (carry robot1 ball15 lgripper1)
   goals met: 11 of 32
43. (drop robot2 ball7 room33 lgripper2)
   deleted: (carry robot2 ball7 lgripper2)
   added: (at ball7 room33) (free robot2 lgripper2)
   goals met: 12 of 32
44. (move robot1 room4 room33)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room33)
   goals met: 12 of 32
45. (move robot3 room4 room17)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room17)
   goals met: 12 of 32
46. (move robot1 room33 room3)
   deleted: (at-robby robot1 room33)
   added: (at-robby robot1 room3)
   goals met: 12 of 32
47. (pick robot3 ball21 room17 lgripper3)
   deleted: (at ball21 room17) (free robot3 lgripper3)
   added: (carry robot3 ball21 lgripper3)
   goals met: 12 of 32
48. (move robot2 room33 room29)
   deleted: (at-robby robot2 room33)
   added: (at-robby robot2 room29)
   goals met: 12 of 32
49. (drop robot1 ball5 room3 rgripper1)
   deleted: (carry robot1 ball5 rgripper1)
   added: (at ball5 room3) (free robot1 rgripper1)
   goals met: 13 of 32
50. (drop robot1 ball15 room3 lgripper1)
   deleted: (carry robot1 ball15 lgripper1)
   added: (at ball15 room3) (free robot1 lgripper1)
   goals met: 14 of 32
51. (move robot3 room17 room14)
   deleted: (at-robby robot3 room17)
   added: (at-robby robot3 room14)
   goals met: 14 of 32
52. (move robot2 room29 room4)
   deleted: (at-robby robot2 room29)
   added: (at-robby robot2 room4)
   goals met: 14 of 32
53. (drop robot3 ball21 room14 lgripper3)
   deleted: (carry robot3 ball21 lgripper3)
   added: (at ball21 room14) (free robot3 lgripper3)
   goals met: 15 of 32
54. (pick robot3 ball12 room14 rgripper3)
   deleted: (at ball12 room14) (free robot3 rgripper3)
   added: (carry robot3 ball12 rgripper3)
   goals met: 15 of 32
55. (move robot1 room3 room13)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room13)
   goals met: 15 of 32
56. (move robot2 room4 room25)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room25)
   goals met: 15 of 32
57. (move robot3 room14 room30)
   deleted: (at-robby robot3 room14)
   added: (at-robby robot3 room30)
   goals met: 15 of 32
58. (pick robot1 ball20 room13 lgripper1)
   deleted: (at ball20 room13) (free robot1 lgripper1)
   added: (carry robot1 ball20 lgripper1)
   goals met: 15 of 32
59. (pick robot2 ball29 room25 lgripper2)
   deleted: (at ball29 room25) (free robot2 lgripper2)
   added: (carry robot2 ball29 lgripper2)
   goals met: 15 of 32
60. (drop robot3 ball12 room30 rgripper3)
   deleted: (carry robot3 ball12 rgripper3)
   added: (at ball12 room30) (free robot3 rgripper3)
   goals met: 16 of 32
61. (move robot1 room13 room31)
   deleted: (at-robby robot1 room13)
   added: (at-robby robot1 room31)
   goals met: 16 of 32
62. (move robot2 room25 room29)
   deleted: (at-robby robot2 room25)
   added: (at-robby robot2 room29)
   goals met: 16 of 32
63. (drop robot1 ball20 room31 lgripper1)
   deleted: (carry robot1 ball20 lgripper1)
   added: (at ball20 room31) (free robot1 lgripper1)
   goals met: 17 of 32
64. (move robot3 room30 room12)
   deleted: (at-robby robot3 room30)
   added: (at-robby robot3 room12)
   goals met: 17 of 32
65. (drop robot2 ball29 room29 lgripper2)
   deleted: (carry robot2 ball29 lgripper2)
   added: (at ball29 room29) (free robot2 lgripper2)
   goals met: 18 of 32
66. (pick robot3 ball2 room12 lgripper3)
   deleted: (at ball2 room12) (free robot3 lgripper3)
   added: (carry robot3 ball2 lgripper3)
   goals met: 18 of 32
67. (pick robot3 ball17 room12 rgripper3)
   deleted: (at ball17 room12) (free robot3 rgripper3)
   added: (carry robot3 ball17 rgripper3)
   goals met: 18 of 32
68. (move robot2 room29 room4)
   deleted: (at-robby robot2 room29)
   added: (at-robby robot2 room4)
   goals met: 18 of 32
69. (move robot1 room31 room4)
   deleted: (at-robby robot1 room31)
   added: (at-robby robot1 room4)
   goals met: 18 of 32
70. (move robot3 room12 room31)
   deleted: (at-robby robot3 room12)
   added: (at-robby robot3 room31)
   goals met: 18 of 32
71. (move robot1 room4 room1)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room1)
   goals met: 18 of 32
72. (move robot2 room4 room25)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room25)
   goals met: 18 of 32
73. (drop robot3 ball2 room31 lgripper3)
   deleted: (carry robot3 ball2 lgripper3)
   added: (at ball2 room31) (free robot3 lgripper3)
   goals met: 19 of 32
74. (pick robot1 ball11 room1 lgripper1)
   deleted: (at ball11 room1) (free robot1 lgripper1)
   added: (carry robot1 ball11 lgripper1)
   goals met: 19 of 32
75. (pick robot2 ball27 room25 lgripper2)
   deleted: (at ball27 room25) (free robot2 lgripper2)
   added: (carry robot2 ball27 lgripper2)
   goals met: 19 of 32
76. (pick robot2 ball26 room25 rgripper2)
   deleted: (at ball26 room25) (free robot2 rgripper2)
   added: (carry robot2 ball26 rgripper2)
   goals met: 19 of 32
77. (move robot3 room31 room15)
   deleted: (at-robby robot3 room31)
   added: (at-robby robot3 room15)
   goals met: 19 of 32
78. (move robot1 room1 room23)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room23)
   goals met: 19 of 32
79. (move robot2 room25 room33)
   deleted: (at-robby robot2 room25)
   added: (at-robby robot2 room33)
   goals met: 19 of 32
80. (drop robot3 ball17 room15 rgripper3)
   deleted: (carry robot3 ball17 rgripper3)
   added: (at ball17 room15) (free robot3 rgripper3)
   goals met: 20 of 32
81. (drop robot1 ball11 room23 lgripper1)
   deleted: (carry robot1 ball11 lgripper1)
   added: (at ball11 room23) (free robot1 lgripper1)
   goals met: 21 of 32
82. (pick robot1 ball22 room23 rgripper1)
   deleted: (at ball22 room23) (free robot1 rgripper1)
   added: (carry robot1 ball22 rgripper1)
   goals met: 21 of 32
83. (drop robot2 ball27 room33 lgripper2)
   deleted: (carry robot2 ball27 lgripper2)
   added: (at ball27 room33) (free robot2 lgripper2)
   goals met: 22 of 32
84. (move robot1 room23 room4)
   deleted: (at-robby robot1 room23)
   added: (at-robby robot1 room4)
   goals met: 22 of 32
85. (move robot3 room15 room33)
   deleted: (at-robby robot3 room15)
   added: (at-robby robot3 room33)
   goals met: 22 of 32
86. (move robot2 room33 room10)
   deleted: (at-robby robot2 room33)
   added: (at-robby robot2 room10)
   goals met: 22 of 32
87. (drop robot1 ball22 room4 rgripper1)
   deleted: (carry robot1 ball22 rgripper1)
   added: (at ball22 room4) (free robot1 rgripper1)
   goals met: 23 of 32
88. (drop robot2 ball26 room10 rgripper2)
   deleted: (carry robot2 ball26 rgripper2)
   added: (at ball26 room10) (free robot2 rgripper2)
   goals met: 24 of 32
89. (move robot3 room33 room26)
   deleted: (at-robby robot3 room33)
   added: (at-robby robot3 room26)
   goals met: 24 of 32
90. (move robot2 room10 room33)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room33)
   goals met: 24 of 32
91. (move robot1 room4 room23)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room23)
   goals met: 24 of 32
92. (move robot3 room26 room25)
   deleted: (at-robby robot3 room26)
   added: (at-robby robot3 room25)
   goals met: 24 of 32
93. (pick robot1 ball19 room23 lgripper1)
   deleted: (at ball19 room23) (free robot1 lgripper1)
   added: (carry robot1 ball19 lgripper1)
   goals met: 24 of 32
94. (pick robot1 ball18 room23 rgripper1)
   deleted: (at ball18 room23) (free robot1 rgripper1)
   added: (carry robot1 ball18 rgripper1)
   goals met: 24 of 32
95. (pick robot3 ball23 room25 lgripper3)
   deleted: (at ball23 room25) (free robot3 lgripper3)
   added: (carry robot3 ball23 lgripper3)
   goals met: 24 of 32
96. (pick robot3 ball14 room25 rgripper3)
   deleted: (at ball14 room25) (free robot3 rgripper3)
   added: (carry robot3 ball14 rgripper3)
   goals met: 24 of 32
97. (move robot2 room33 room19)
   deleted: (at-robby robot2 room33)
   added: (at-robby robot2 room19)
   goals met: 24 of 32
98. (move robot1 room23 room26)
   deleted: (at-robby robot1 room23)
   added: (at-robby robot1 room26)
   goals met: 24 of 32
99. (move robot3 room25 room26)
   deleted: (at-robby robot3 room25)
   added: (at-robby robot3 room26)
   goals met: 24 of 32
100. (pick robot2 ball30 room19 lgripper2)
   deleted: (at ball30 room19) (free robot2 lgripper2)
   added: (carry robot2 ball30 lgripper2)
   goals met: 24 of 32
101. (drop robot1 ball18 room26 rgripper1)
   deleted: (carry robot1 ball18 rgripper1)
   added: (at ball18 room26) (free robot1 rgripper1)
   goals met: 25 of 32
102. (drop robot3 ball14 room26 rgripper3)
   deleted: (carry robot3 ball14 rgripper3)
   added: (at ball14 room26) (free robot3 rgripper3)
   goals met: 26 of 32
103. (move robot2 room19 room10)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room10)
   goals met: 26 of 32
104. (move robot1 room26 room14)
   deleted: (at-robby robot1 room26)
   added: (at-robby robot1 room14)
   goals met: 26 of 32
105. (move robot3 room26 room19)
   deleted: (at-robby robot3 room26)
   added: (at-robby robot3 room19)
   goals met: 26 of 32
106. (drop robot2 ball30 room10 lgripper2)
   deleted: (carry robot2 ball30 lgripper2)
   added: (at ball30 room10) (free robot2 lgripper2)
   goals met: 27 of 32
107. (drop robot1 ball19 room14 lgripper1)
   deleted: (carry robot1 ball19 lgripper1)
   added: (at ball19 room14) (free robot1 lgripper1)
   goals met: 28 of 32
108. (drop robot3 ball23 room19 lgripper3)
   deleted: (carry robot3 ball23 lgripper3)
   added: (at ball23 room19) (free robot3 lgripper3)
   goals met: 29 of 32
109. (move robot2 room10 room33)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room33)
   goals met: 29 of 32
110. (move robot1 room14 room33)
   deleted: (at-robby robot1 room14)
   added: (at-robby robot1 room33)
   goals met: 29 of 32
111. (move robot3 room19 room11)
   deleted: (at-robby robot3 room19)
   added: (at-robby robot3 room11)
   goals met: 29 of 32
112. (move robot2 room33 room18)
   deleted: (at-robby robot2 room33)
   added: (at-robby robot2 room18)
   goals met: 29 of 32
113. (pick robot3 ball31 room11 lgripper3)
   deleted: (at ball31 room11) (free robot3 lgripper3)
   added: (carry robot3 ball31 lgripper3)
   goals met: 29 of 32
114. (pick robot3 ball28 room11 rgripper3)
   deleted: (at ball28 room11) (free robot3 rgripper3)
   added: (carry robot3 ball28 rgripper3)
   goals met: 29 of 32
115. (pick robot2 ball10 room18 lgripper2)
   deleted: (at ball10 room18) (free robot2 lgripper2)
   added: (carry robot2 ball10 lgripper2)
   goals met: 29 of 32
116. (move robot3 room11 room19)
   deleted: (at-robby robot3 room11)
   added: (at-robby robot3 room19)
   goals met: 29 of 32
117. (move robot2 room18 room33)
   deleted: (at-robby robot2 room18)
   added: (at-robby robot2 room33)
   goals met: 29 of 32
118. (drop robot3 ball28 room19 rgripper3)
   deleted: (carry robot3 ball28 rgripper3)
   added: (at ball28 room19) (free robot3 rgripper3)
   goals met: 30 of 32
119. (drop robot2 ball10 room33 lgripper2)
   deleted: (carry robot2 ball10 lgripper2)
   added: (at ball10 room33) (free robot2 lgripper2)
   goals met: 31 of 32
120. (move robot3 room19 room18)
   deleted: (at-robby robot3 room19)
   added: (at-robby robot3 room18)
   goals met: 31 of 32
121. (drop robot3 ball31 room18 lgripper3)
   deleted: (carry robot3 ball31 lgripper3)
   added: (at ball31 room18) (free robot3 lgripper3)
   goals met: 32 of 32
